<?php

// +----------------------------------------------------------------------
// | JiZhiCMS { 极致CMS，给您极致的建站体验 } 
// +----------------------------------------------------------------------
// | Copyright (c) 2018-2099 http://www.jizhicms.com All rights reserved.
// +----------------------------------------------------------------------
// | Author: 留恋风 <2581047041@qq.com>
// +----------------------------------------------------------------------
// | Date：2019/01-2019/02
// +----------------------------------------------------------------------


namespace A\c;

use FrPHP\lib\Controller;

class ErrorController extends Controller
{
	//错误处理示例
	function index($msg){
		header("HTTP/1.0 404");
		$msg = format_param($msg,1);
		echo '错误信息提示：<br/>';	
		echo $msg;

    }
}
	